import { NextPage } from "next";

import ShippingMeta from "components/meta/ShippingMeta";
import TextBlock from "components/TextBlock";
import useLanguage from "hooks/useLanguage";

const ShippingPage: NextPage = () => {
  const { langVariant } = useLanguage();
  const TITLE = langVariant("Доставка і оплата", "Доставка и оплата");

  return (
    <div className="lg:max-w-full lg:mx-auto lg:px-12">
      <ShippingMeta />

      <h1>{TITLE}</h1>
      <h2>Доставка</h2>
      <div className="mt-3 space-y-5">
        <TextBlock title={langVariant("Самовивіз", "Самовывоз")}>
          <p>
            {langVariant(
              `Ви маєте можливість забрати замовлення у зручному для вас магазині нашій
              мережі у зручний для вас час у режимі роботи магазину. Якщо товару
              немає в наявності у вибраному вами магазині, не біда. Ми доставимо його
              абсолютно безкоштовно в максимально стислий термін і, звичайно ж,
              повідомимо про те, що товар на вас чекає. Ми резервуємо для вас товар
              на три дні. Для того, щоб отримати замовлення, вам необхідно назвати
              співробітнику магазину лише номер замовлення, вам необхідно назвати
              співробітнику магазину тільки номер замовлення, який буде надіслано
              номер телефону після підтвердження. При отриманні замовлення
              магазині ви можете оплатити його будь-яким зручним для вас способом:
              готівкою, банківською платіжною карткою Visa/MasterCard, по
              безготівковому розрахунку або оформити кредит, а також скористатися
              сервісами «Оплата частинами» та «Миттєва розстрочка» від нашого
              банку-партнера ПриватБанк.`,

              `Вы имеете возможность забрать заказ в удобном для вас магазине нашей
            сети в удобное для вас время в режиме работы магазина. Если товара
            нет в наличии в выбранном вами магазине, не беда. Мы доставим его
            абсолютно бесплатно в максимально сжатые сроки и, конечно же,
            уведомим о том, что товар вас ожидает. Мы резервируем для вас товар
            на три дня. Для того чтобы получить заказ, вам необходимо назвать
            сотруднику магазина только номер заказа, который будет отправлен на
            ваш номер телефона после подтверждения. При получении заказа в
            магазине вы можете оплатить его любым удобным для вас способом:
            наличными, банковской платежной картой Visa/MasterCard, по
            безналичному расчету или оформить кредит, а также воспользоваться
            сервисами «Оплата частями» и «Мгновенная рассрочка» от нашего
            банка-партнера ПриватБанк.`
            )}
          </p>
        </TextBlock>

        <TextBlock
          title={langVariant("Доставка за адресою", "Доставка по адресу")}
        >
          <p>
            {langVariant(
              `Ви можете отримати замовлення, не виходячи з дому або офісу. Для цього при
             оформленні замовлення вкажіть повну адресу доставки, та кур'єр доставить
             його вам. Сплатити замовлення ви можете попередньо при оформленні на
             сайті - банківською платіжною карткою Visa/MasterCard, через Приват24,
             за допомогою сервісів ПриватБанку «Оплата частинами» та «Миттєва
             розстрочка», а також за безготівковим розрахунком, згідно з рахунком-фактурою.
             Також є можливість сплатити замовлення кур'єру при доставці.`,

              `Вы можете получить заказ не выходя из дома или офиса. Для этого при
            оформлении заказа укажите полный адрес доставки, и курьер доставит
            его вам. Оплатить заказ вы можете предварительно при оформлении на
            сайте - банковской платежной картой Visa/MasterCard, через Приват24,
            с помощью сервисов ПриватБанка «Оплата частями» и «Мгновенная
            рассрочка», а также по безналичному расчету, согласно счета-фактуры.
            Также есть возможность оплатить заказ курьеру при доставке.`
            )}
          </p>
          <p>
            {langVariant(
              `Доставка за адресою здійснюється протягом трьох робочих днів. При
             надходженні товару до вашого населеного пункту з вами зв'яжеться кур'єр та
             погодить зручні дату та час отримання.`,

              `Доставка по адресу осуществляется в течение трех рабочих дней. При
             поступлении товара в ваш населенный пункт с вами свяжется курьер и
             согласует удобные дату и время получения.`
            )}
          </p>
          <p>
            {langVariant(
              `Вартість доставки при замовленні до 500 грн. становить 50 грн., якщо
             сума вашого замовлення понад 500 грн. - Ми доставимо його безкоштовно.`,

              `Стоимость доставки при заказе до 500 грн. составляет 50 грн., если
            же сумма вашего заказа свыше 500 грн. - мы доставим его бесплатно.`
            )}
          </p>
        </TextBlock>
        <h2>Оплата</h2>
        <div className="mt-3 space-y-5">
          <TextBlock
            title={langVariant(
              "Готівкою при отриманні",
              "Наличными при получении"
            )}
          >
            <p>
              {langVariant(
                `Сплатити готівкою при отриманні замовлення можна як у магазинах
               нашої мережі, як на відділенні кур'єрської служби, так і при адресній
               доставці.`,

                `Оплатить наличными при получении заказа можно как в магазинах
               нашей сети, на отделении курьерской службы, так и при адресной
               доставке.`
              )}
            </p>
          </TextBlock>
          <TextBlock
            title={langVariant(
              "Банківською платіжною карткою на сайті",
              "Банковской платежной картой на сайте"
            )}
          >
            <p>
              {langVariant(
                `Ви можете сплатити замовлення відразу при оформленні на сайті банківської
                платіжною карткою Visa/MasterCard. Даний тип оплати можливий за
                виборі доставки на відділення кур'єрської служби або доставки по
                адресою.`,

                `Вы можете оплатить заказ сразу при оформлении на сайте банковской
                платежной картой Visa/MasterCard. Данный тип оплаты возможен при
                выборе доставки на отделение курьерской службы или доставки по
                адресу.`
              )}
            </p>
          </TextBlock>
        </div>
      </div>
    </div>
  );
};

export default ShippingPage;
